In [1]:
import pandas as pd
import numpy as np

In [6]:
empleados = {
    'Nombres' : [
        'Ana García', 'Luis Martínez', 'Sofía Rodríguez', 'Carlos Fernández',
        'María López', 'Pedro González', 'Laura Pérez', 'Diego Sánchez',
        'Elena Ramírez', 'Pablo Torres'

    ],
    'edades':[35, 28, 42, 50, 31, 26, 39, 45, 33, 29],
    'Salarios':[55000.75, 48000.50, 62000.25, 78000.00, 51000.90,
        45000.10, 59000.80, 72000.40, 53000.60, 49000.30]
}

for k,v in emplados.items():
    k : v
empleados

{'Nombres': ['Ana García',
  'Luis Martínez',
  'Sofía Rodríguez',
  'Carlos Fernández',
  'María López',
  'Pedro González',
  'Laura Pérez',
  'Diego Sánchez',
  'Elena Ramírez',
  'Pablo Torres'],
 'edades': [35, 28, 42, 50, 31, 26, 39, 45, 33, 29],
 'Salarios': [55000.75,
  48000.5,
  62000.25,
  78000.0,
  51000.9,
  45000.1,
  59000.8,
  72000.4,
  53000.6,
  49000.3]}

In [7]:
df_empleados = pd.DataFrame(empleados)
df_empleados

            Nombres  edades  Salarios
0        Ana García      35  55000.75
1     Luis Martínez      28  48000.50
2   Sofía Rodríguez      42  62000.25
3  Carlos Fernández      50  78000.00
4       María López      31  51000.90
5    Pedro González      26  45000.10
6       Laura Pérez      39  59000.80
7     Diego Sánchez      45  72000.40
8     Elena Ramírez      33  53000.60
9      Pablo Torres      29  49000.30

In [18]:
df_empleados['Nombres']

0          Ana García
1       Luis Martínez
2     Sofía Rodríguez
3    Carlos Fernández
4         María López
5      Pedro González
6         Laura Pérez
7       Diego Sánchez
8       Elena Ramírez
9        Pablo Torres
Name: Nombres, dtype: object

In [22]:
df_empleados['aumento'] = df_empleados['Salarios'] * 2
df_empleados

            Nombres  edades  Salarios   aumento
0        Ana García      35  55000.75  110001.5
1     Luis Martínez      28  48000.50   96001.0
2   Sofía Rodríguez      42  62000.25  124000.5
3  Carlos Fernández      50  78000.00  156000.0
4       María López      31  51000.90  102001.8
5    Pedro González      26  45000.10   90000.2
6       Laura Pérez      39  59000.80  118001.6
7     Diego Sánchez      45  72000.40  144000.8
8     Elena Ramírez      33  53000.60  106001.2
9      Pablo Torres      29  49000.30   98000.6

In [24]:
df_empleados[0:3]

           Nombres  edades  Salarios   aumento
0       Ana García      35  55000.75  110001.5
1    Luis Martínez      28  48000.50   96001.0
2  Sofía Rodríguez      42  62000.25  124000.5

In [25]:
df_empleados.describe()

          edades      Salarios        aumento
count  10.000000     10.000000      10.000000
mean   35.800000  57200.460000  114400.920000
std     7.955431  10747.511654   21495.023309
min    26.000000  45000.100000   90000.200000
25%    29.500000  49500.450000   99000.900000
50%    34.000000  54000.675000  108001.350000
75%    41.250000  61250.387500  122500.775000
max    50.000000  78000.000000  156000.000000